In [1]:
import pandas as pd

In [2]:
df_customers = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/customers.csv")
df_transactions = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/transactions.csv")
df_products = pd.read_csv("https://dojo-git.s3.eu-west-3.amazonaws.com/raw/products.csv")

In [3]:
df_customers.head()

  client_id sex  birth
0    c_4410   f   1967
1    c_7839   f   1975
2    c_1699   f   1984
3    c_5961   f   1962
4    c_5320   m   1943

In [4]:
df_transactions.head()

  id_prod                        date session_id client_id
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232

In [5]:
df_products.head()

  id_prod  price  categ
0  0_1421  19.99      0
1  0_1368   5.13      0
2   0_731  17.99      0
3   1_587   4.99      1
4  0_1507   3.99      0

In [7]:
df_merged = pd.merge(df_transactions, df_products, on='id_prod')
df_merged.head()

  id_prod                        date session_id client_id  price  categ
0  0_1518  2022-05-20 13:21:29.043970   s_211425     c_103   4.18      0
1   1_251  2022-02-02 07:55:19.149409   s_158752    c_8534  15.99      1
2  0_1277  2022-06-18 15:44:33.155329   s_225667    c_6714   7.99      0
3   2_209  2021-06-24 04:19:29.835891    s_52962    c_6941  69.99      2
4  0_1509  2023-01-11 08:22:08.194479   s_325227    c_4232   4.99      0

In [8]:
df_final = pd.merge(df_merged, df_customers, on='client_id')
df_final.head()

,id_prod,date,session_id,client_id,price,categ,sex,birth
0,0_1518,2022-05-20 13:21:29.043970,s_211425,c_103,4.18,0,f,1986
1,1_251,2022-02-02 07:55:19.149409,s_158752,c_8534,15.99,1,m,1988
2,0_1277,2022-06-18 15:44:33.155329,s_225667,c_6714,7.99,0,f,1968
3,2_209,2021-06-24 04:19:29.835891,s_52962,c_6941,69.99,2,m,2000
4,0_1509,2023-01-11 08:22:08.194479,s_325227,c_4232,4.99,0,m,1980

In [12]:
df_final.isna().sum()

id_prod       0
date          0
session_id    0
client_id     0
price         0
categ         0
sex           0
birth         0
dtype: int64

In [13]:
df_final.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 679311 entries, 0 to 679310
Data columns (total 8 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   id_prod     679311 non-null  object
 1   date        679311 non-null  object
 2   session_id  679311 non-null  object
 3   client_id   679311 non-null  object
 4   price       679311 non-null  float64
 5   categ       679311 non-null  int64
 6   sex         679311 non-null  object
 7   birth       679311 non-null  int64
dtypes: float64(1), int64(2), object(5)
memory usage: 41.5+ MB

In [18]:
df_final.describe()

               price          categ          birth
count  679311.000000  679311.000000  679311.000000
mean       17.449340       0.441823    1977.817976
std        18.329034       0.595002      13.579191
min        -1.000000       0.000000    1929.000000
25%         8.820000       0.000000    1970.000000
50%        13.990000       0.000000    1980.000000
75%        18.990000       1.000000    1987.000000
max       300.000000       2.000000    2004.000000

In [19]:
df_final.isnull().sum()

id_prod       0
date          0
session_id    0
client_id     0
price         0
categ         0
sex           0
birth         0
dtype: int64

In [22]:
df_final.duplicated().sum()

126

In [23]:
df_sans_doublons = df_final.drop_duplicates()

In [24]:
df_sans_doublons.duplicated().sum()

0